tutorials/multiphase/interPhaseChangeFoam/throttleZwart/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (water vapour);

phaseChangeTwoPhaseMixture Zwart;

pSat            2300;   // Saturation pressure

sigma           0.07;

water
{
    transportModel  Newtonian;
    nu              9e-07;
    rho             1000;
}

vapour
{
    transportModel  Newtonian;
    nu              4.273e-04;
    rho             0.02308;
}

KunzCoeffs
{
    UInf            U20.0;
    tInf            t0.005; // L = 0.1 m
    Cc              C1000;
    Cv              C1000;
}

MerkleCoeffs
{
    UInf            20.0;
    tInf            0.005;  // L = 0.1 m
    Cc              80;
    Cv              1e-03;
}

SchnerrSauerCoeffs
{
    n               1.6e+13;
    dNuc            2.0e-06;
    Cc              1;
    Cv              1;
}

ZwartCoeffs
{
    Cc              0.01;
    Cv              50;
    rNuc 5.0e-04;
    Rb 1.0e-06;
}
// ************************************************************************* //
